// ============================================================
// 1.平板電腦一台15000元，每星期儲存1250元。寫一程式使用do...while計算需要幾個星期才能儲存足夠的錢購買平板電腦。
// ============================================================
Console.WriteLine("============================================================");
Console.WriteLine("Q:平板電腦一台15000元，每星期儲存1250元。寫一程式使用do...while計算需要幾個星期才能儲存足夠的錢購買平板電腦。");
// 電腦價格
double price = 15000;
// 每星期存錢
double save = 1250;
// 需要週數
double weekCount = 0;
// 每過一週就+1，並把價格減去存錢金額，直到價格小於零為止
do
{
    weekCount = weekCount + 1;
    price = price - save;
} while (price > 0);
Console.WriteLine("A:共需要" + weekCount + "個星期");

// ============================================================
// 2.寫一程式，產生10個介於1-41的亂數，並儲存到陣列array1裡。
// ============================================================
Console.WriteLine("============================================================");
Console.WriteLine("Q:寫一程式，產生10個介於1-41的亂數，並儲存到陣列array1裡。");
Console.WriteLine("A:共產生以下亂數");
// 亂數產生器
Random random = new Random();
// 宣告一個陣列
int[] array1 = new int[10];
// 用for跑10次
for (int i = 0; i < 10; i++)
{
    // 產生介於1-41的亂數，並將每次存在陣列裡
    // Next第一個參數是放最小值min，第二個參數是放最大值max但始終小於，所以要多+1
    // 寫成數學就是 min <= 亂數 < max
    array1[i] = random.Next(1, 41 + 1);
    // 印出來
    Console.Write(array1[i] + " ");
}
Console.WriteLine();

// ============================================================
// 3.接續第1題，將陣列array1裡的元素加總後，再算其均值。
// ============================================================
Console.WriteLine("============================================================");
Console.WriteLine("Q:接續第1題，將陣列array1裡的元素加總後，再算其均值。");
// 加總值
double total = 0;
for (int i = 0; i < 10; i++)
{
    total = total + array1[i];
}
// 平均值
double avg = total / 10;
Console.WriteLine("A:加總後是 " + total + "，平均後是 " + avg);

// ============================================================
// 4.使用雙層for顯示下列圖案:
// *****
// ****
// ***
// **
// *
// ============================================================
Console.WriteLine("============================================================");
Console.WriteLine("Q:使用雙層for顯示下列圖案");
Console.WriteLine("A:");
// 一共5排(從0開始算起)
for (int i = 0; i < 5; i++)
{
    // 每排的星星數量 = 5 - 當前位於第幾排
    for (int j = 0; j < 5 - i; j++)
    {
        Console.Write("*");
    }
    // 換行
    Console.WriteLine();
}